#### WireDistributionDirection Enumeration

---

|  |
| --- |
| See Also |

Defines the direction of the distribution of wires in a Fabric Sheet.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public enum WireDistributionDirection ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WireDistributionDirection ``` |

| Visual C++ |
| --- |
| ``` public enum class WireDistributionDirection ``` |

# Members

| Member name | Description |
| --- | --- |
| Major | Wires are distributed in the Major direction. Uncomment following for 2020.1 text "Major" |
| Minor | Wires are distributed in the Minor direction. Uncomment following for 2020.1 text "Minor" |

# See Also

Autodesk.Revit.DB.Structure Namespace